{
  "id": "you-never-regret-the-family-you-choose-chapter-1",
  "name": "You Never Regret The Family You Choose",
  "description": "A story about emotional betrayal, trust, and redemption through confronting a friend's carelessness and inner fears, centered around the loss and recovery of a beloved dog named Lune.",
  "arc": "arc-1",
  "currentChapter": 1,
  "chapters": [
    {
      "number": 1,
      "name": "A Promise Kept Too Long",
      "overview": "The chapter begins with a warm morning routine disrupted by Kaylin's carelessness, leading to Lune's disappearance. It escalates through rising tension, investigation, emotional confrontations, and an inner space revelation, culminating in aftermath and downtime reflection.",
      "scenes": [
        {
          "number": 1,
          "name": "Morning Light, Easy Trust",
          "location": "The player’s apartment",
          "music": "track-id-warm-morning",
          "content": "Warm early light. The smell of coffee. Quiet routine. Lune (the dog) padding around happily. Tone: Warm, familiar, gently humorous; the calm before the emotional twist.\n\nMC READ-ALOUD: “Morning hums with quiet comfort. Lune trots between your legs, tail thumping against the cabinets. Kaylin Vale leans on your counter, phone in hand, sunglasses still on indoors like she’s on the tail end of last night’s glow. She laughs at something you didn’t hear. For a moment, everything feels easy.”\n\nKaylin — Dialogue Palette: “Okay, okay — listen. I cannot be late again. That gallery is life or death.” “You’re my grounding wire, babe. My reality check.” “Wait — WAIT — I have an idea. Let me take Lune today. Seriously! It’ll help you focus, and she LOVES me.” “What’s that face? I promise—like actually promise—I can handle it.” “Oh come on… trust me. One tiny favor.”\n\nMC Note: The player should be hesitant. Encourage them to voice that feeling.\n\nPlayer Prompt: “What is it about Kaylin’s tone that makes you hesitate: her confidence, her frenetic energy, or the way she assumes you’ll say yes?” Let them describe their instinct. Encourage vulnerability.\n\nEmotional Subtext: Kaylin is not malicious. She is careless. She loves attention and praise more than responsibility. Her Ignorance (later revealed) is rooted in fear of losing people unless she keeps them entertained.\n\nStatus Tags Granted at Scene End: If the player agrees easily: Open-Hearted-1. If the player hesitates: Gut-Feeling-1. If the player questions Kaylin: Unsettled-1.\n\nScene Summary (Original): Kaylin leaves with Lune. The mood is optimistic but uneasy. There is a subtle emotional imbalance — Kaylin is used to being adored, forgiven, and accommodated.",
          "npcs": ["kaylin-vale"],
          "tags": ["warm-routine", "trust-building"]
        },
        {
          "number": 2,
          "name": "The Evening Call",
          "location": "Quiet apartment with one detail wrong: Lune isn’t home yet",
          "music": "track-id-rising-tension",
          "content": "Early evening. Soft rain starting. Tone: Rising tension wrapped in Kaylin’s casual dismissal. A turning point where concern turns to dread.\n\nMC READ-ALOUD: “Rain freckles the window as you clean up after dinner. Lune should be home by now — you told Kaylin she just needed a walk and a cuddle, nothing complicated. Your phone buzzes. Kaylin’s name. One text. Then another.” Text 1: “Minor chaos. Don’t freak out!” Text 2: “Lune bolted when thunder hit. She’ll come back.” There is no follow-up. Just three dots. Then nothing.\n\nThe Phone Call (Original Version Dialogue): If the player calls: Kaylin: “Oh THANK GOD you’re calling. My battery is at like 3%.” “Look, please chill. It’s just a dog. Nature built them for this.” “I tried! She tugged the leash and I didn’t want to yank her too hard — that’s dangerous.” “Wow. Okay. You don’t have to turn this into a federal case.” “I SAID I’m sorry. What more do you want?” If the player stays silent / texts instead: Kaylin texts: “You’re being dramatic.” “I’m literally doing my best.” “I’ll retrace my steps or whatever.”\n\nMC Note: Kaylin is defensive, panicked, and incapable of owning her mistake in this moment. She knows she messed up and her Ignorance twists her fear into dismissal.\n\nPlayer Prompts: “How do you react when someone minimizes your fear?” “What’s the FIRST thing you do?” Grab jacket and go. Freeze in place. Text back harshly. Call again. Speak calmly but firmly. Encourage emotional honesty, not optimal choices.\n\nInvestigation Setup (Original Draft): This is where the campaign shifts from a social scene to an investigative one. MC READ-ALOUD: “You step out into the wet evening, heart pounding harder than the rain. The streetlights flicker like they’re waiting for something to go wrong.” The investigation begins.\n\nEnvironmental Tags (Original Version): Rising Anxiety-2 (temporary). Storm Coming (environmental). Deflective Apology (ongoing).\n\nStory Tags Gained: Where-Is-Lune?-1 — emotional focus. Trust-Cracking-1 — seeds of doubt. Something’s-Not-Right-1.\n\nScene Summary (Original): This scene establishes: The moment of betrayal is not malicious — it’s carelessness + avoidance. Kaylin’s emotional reflex is deflection, not cruelty. The player is pulled into a rising urgency, with genuine stakes but no harm to Lune.\n\nExpanded Branching Version: With Reactive Story Tags & Paths. Branching Decision Tree: Path A — Calling Kaylin Immediately (fight response). Path B — Texting Back First (freeze/people-please response). Path C — Taking Action Without Contacting Kaylin (flight/self-reliance response). Optional Fourth Path — If Player Does Nothing (freeze response). These paths feed into Scene 3 pacing and consequences.",
          "npcs": ["kaylin-vale"],
          "tags": ["rising-tension", "emotional-turning-point"]
        },
        {
          "number": 3,
          "name": "Searching for Lune",
          "location": "The neighborhood at dusk",
          "music": "track-id-panic-heartbreak",
          "content": "Rain settling into a light drizzle. Streetlights making little halos across the pavement. Tone: Panic softening into heartbreak. The player’s first real confrontation with Kaylin’s avoidance and inconsistent behavior. Clarity is emerging, but so is hurt.\n\nMC READ-ALOUD (Universal Scene Start): “The rain has gone from sharp to steady, the kind that dampens your clothes just enough to feel heavy. You call Lune’s name through the quiet streets. Porch lights flicker on as you pass. You see puddles, pawprints fading in the water. You keep walking. You don’t stop.”\n\nBranch Fold-In Point: Integrates consequences from Scene 2 paths (Call First, Text First, Search Alone, Freeze).\n\nUniversal Investigation: Get a Clue Options — Clue 1: The Neighbor. Clue 2: Phone Data. Clue 3: Half-Deleted Voice Memo. Clue 4: Found Collar.\n\nKaylin’s Behavior During Search: Cycles through defensiveness, guilt, minimizing, tearful confusion, blaming thunder, blaming herself, blaming the leash, blaming “your vibe right now”. This emotional inconsistency is the first major sign of her Star of Ignorance.\n\nEnvironmental Tags: Wet Streets (ongoing). Echoing Footsteps (ambient). Heart-in-Throat-2 (emotional). Storm-Scented Air (atmospheric). Pulling-Toward-the-Park-1 (narrative).\n\nScene Transition Marker: Once the player gathers at least 2 clues, or reaches the park, or emotionally confronts Kaylin, move to Scene 4.\n\nExpanded: Early Mini-Confrontations (Triggered by Call First or Search Alone First paths). Mini-Confrontation System: Outcomes based on rolls (Success, Partial Success, Miss). Mini-Confrontation #1: “Why Didn’t You Tell Me Immediately?”. Mini-Confrontation #2: “Your Timeline Doesn’t Add Up.”. Mini-Confrontation #3: Optional High-Tension Variant.",
          "npcs": ["kaylin-vale"],
          "tags": ["investigation", "emotional-confrontation"]
        },
        {
          "number": 4,
          "name": "The Park & The Mask",
          "location": "The neighborhood park at night",
          "music": "track-id-unraveling-trust",
          "content": "String lights dampened by rain. Empty stage from an old open-mic night. Bench swings creaking in the breeze. Tone: Unraveling trust. Emotional surrealism creeping in around the edges. Truth breaking through the fog.\n\nMC READ-ALOUD (Scene Entrance): “As you step into the park, the rain thins into a mist, clinging to the air like breath on glass. The string lights sway overhead, casting little halos of gold on the wet pavement. And then— You see her. Kaylin stands beneath the lamp near the old community stage, holding something small and familiar in her hand. Lune’s collar. Unclipped. Dangling like an accessory she forgot to put away.”\n\nKaylin’s Initial Response: Tries to act breezy. Branches based on Scene 2/3 paths.\n\nConfrontation Spark: Triggers emotional transformation when player calls out inconsistency or expresses hurt.\n\nMC READ-ALOUD — The Mask Appears: Air shifts, colors bend, shards of crystal form a mirrored visor over her eye.\n\nKaylin’s First Ignorance Monologue: Raw speech rooted in insecurity.\n\nEnvironmental Tags: Spotlight Distortion (ongoing). Cracked Reflections (ongoing). Emotional Static-2. Public Memory-2. Loose Leash (environmental).\n\nPlayer Options: Confront, Comfort, Question, Retreat, Cry, Lash out, Confess, Set boundaries.\n\nScene 4 Transition Trigger: Moves to Inner Space when emotional buildup peaks.",
          "npcs": ["kaylin-vale"],
          "tags": ["emotional-climax", "ignorance-reveal"]
        },
        {
          "number": 5,
          "name": "Inner Space: Empty Applause",
          "location": "Inner Space Theater",
          "music": "track-id-emotional-surrealism",
          "content": "Revised: Five Ignorance Locks — One for Each Limit Point (5). Structure Overview: Kaylin’s Ignorance Limit = 5, containing 5 Constructs.\n\nInner Space Setting: MC READ-ALOUD: “The theater around you stretches impossibly tall. Rows upon rows of mirrored seats clap in eerie unison. A giant stage light bathes Kaylin in a harsh, artificial glow. But now— you notice five distortions in the space. Five illusions, solidified into shape. Five pieces of her Ignorance made visible.”\n\nThe Five Ignorance Constructs: Lock 1 — “The Lonely Spotlight”. Lock 2 — “The Audience of Mirrors”. Lock 3 — “The Ribbon Leash”. Lock 4 — “The Cracked Visor”. Lock 5 — “The Empty Stage”. Each breakable using Talk It Out, Care, or Slay.\n\nResolution Trigger: All locks broken, Ignorance dissolves.\n\nBranching Micro-Epilogues: Depend on final break method (Talk It Out, Care, Slay).",
          "npcs": ["kaylin-vale"],
          "tags": ["inner-space", "emotional-constructs"]
        },
        {
          "number": 6,
          "name": "Aftermath",
          "location": "The park at night",
          "music": "track-id-relief-reflection",
          "content": "Back in the real world. Lune is safe. Kaylin is exhausted. The rain has finally stopped.\n\nMC READ-ALOUD (Universal Return): “The world slides back into place — the smell of wet grass, the glow of the park lights, the earth under your feet. Lune pushes her head into your hand, tail wagging uncertainly. Kaylin stands a few steps away. Her visor is gone. Her eyes are red. She looks smaller than you’ve ever seen her.”\n\nTwo Ending Paths: Redeemed Kaylin (Path of closeness) or Not Redeemed (Path of distance). Triggered by player choice: “Do you reach toward Kaylin… or step back?” Each with dialogue, mechanical rewards, and end read-aloud.",
          "npcs": ["kaylin-vale"],
          "tags": ["resolution", "emotional-ledge"]
        }
      ],
      "innerSpace": {
        "description": "A surreal theater space representing Kaylin's deepest fears of abandonment and need for validation, with five ignorance constructs to confront.",
        "coreWounds": [
          {
            "name": "Fear of Abandonment",
            "description": "Kaylin's core wound rooted in needing constant attention and validation to avoid being left alone.",
            "approaches": {
              "talkItOut": "Speak honestly about not needing performance for connection.",
              "care": "Offer genuine compassion and presence without demands.",
              "slay": "Set firm boundaries and confront lies directly."
            },
            "tags": ["insecurity", "validation-dependence"]
          }
        ],
        "counters": {
          "acceptance": {
            "description": "Represents building trust and emotional honesty.",
            "triggers": ["Successful Talk It Out or Care approaches"]
          },
          "rejection": {
            "description": "Represents deepening defensiveness and distance.",
            "triggers": ["Failed confrontations or harsh Slay approaches"]
          }
        }
      },
      "aftermath": {
        "outcomes": [
          {
            "condition": "best",
            "description": "Kaylin is redeemed through compassion or honesty.",
            "consequences": ["Strengthened emotional bonds", "Kaylin becomes an ally"],
            "nextChapterImpact": "Easier empathy rolls in future chapters"
          },
          {
            "condition": "partial",
            "description": "Partial redemption with lingering doubts.",
            "consequences": ["Mixed tags gained"],
            "nextChapterImpact": "Balanced impacts on Chapter 2"
          },
          {
            "condition": "worst",
            "description": "Kaylin is not redeemed, leading to distance.",
            "consequences": ["Emotional boundaries set", "Increased self-reliance"],
            "nextChapterImpact": "Boost to resist rolls but penalties to empathy"
          }
        ]
      },
      "consequences": {
        "description": "Long-term emotional ripple effects from Kaylin's revelation and the player's choices.",
        "rippleEffects": ["Influences Chapter 2 confrontations with Leo", "Shifts player growth themes like Rainbow or Anchor"]
      },
      "scalingAndPacing": {
        "partySize": {
          "1-2": {
            "ignoranceLimit": 5,
            "pawns": 1,
            "difficulty": "Standard"
          },
          "3-4": {
            "ignoranceLimit": 6,
            "pawns": 2,
            "difficulty": "Standard"
          },
          "5+": {
            "ignoranceLimit": 7,
            "pawns": 3,
            "difficulty": "Standard"
          }
        },
        "sessionLength": {
          "oneShot": "4-5 hours - Streamline scenes, focus on key moments",
          "twoSession": "Session 1: Scenes 1-3 (3-4 hours), Session 2: Scenes 4-Aftermath (3-4 hours)",
          "epic": "3+ sessions - Expand each scene with additional encounters"
        },
        "difficultyAdjustments": {
          "easier": {
            "ignoranceLimitModifier": -1,
            "additionalTags": 2,
            "note": "Give more story tags from investigation"
          },
          "harder": {
            "ignoranceLimitModifier": 2,
            "additionalPawns": 1,
            "note": "Add environmental hazards"
          }
        }
      },
      "combatEncounters": [
        {
          "name": "Inner Space Constructs",
          "type": "emotional-combat",
          "ignoranceLimit": 5,
          "pawns": 0,
          "specialMechanics": ["Break constructs using Talk It Out, Care, or Slay"],
          "location": "Inner Space Theater"
        }
      ]
    }
  ],
  "npcs": [
    {
      "id": "kaylin-vale",
      "name": "Kaylin Vale",
      "role": "neutral",
      "imageUrl": "https://url-to-image.jpg",
      "description": "A careless friend who loves attention and praise more than responsibility. Her Ignorance is rooted in fear of losing people.",
      "motivations": ["Seek validation", "Avoid abandonment"],
      "backstory": "Emotional reflex is deflection; masks panic with snark.",
      "justicKnight": {
        "isJusticeKnight": false,
        "construct": "",
        "ignoranceLimit": 0,
        "moves": []
      }
    },
    {
      "id": "lune",
      "name": "Lune",
      "role": "ally",
      "imageUrl": "https://url-to-image.jpg",
      "description": "The player's loyal dog, central to the emotional stakes.",
      "motivations": ["Provide comfort", "Anchor the player"],
      "backstory": "Bolts during thunder due to Kaylin's carelessness.",
      "justicKnight": {
        "isJusticeKnight": false,
        "construct": "",
        "ignoranceLimit": 0,
        "moves": []
      }
    }
  ],
  "locations": [
    {
      "id": "players-apartment",
      "name": "Player’s Apartment",
      "imageUrl": "https://url-to-image.jpg",
      "description": "Warm and familiar space with quiet routine.",
      "atmosphere": "Comforting, gently humorous",
      "musicSuggestions": ["warm-morning", "quiet-routine"]
    },
    {
      "id": "neighborhood-streets",
      "name": "Neighborhood Streets",
      "imageUrl": "https://url-to-image.jpg",
      "description": "Wet evening streets with fading pawprints.",
      "atmosphere": "Rising tension and dread",
      "musicSuggestions": ["rising-tension", "panic-heartbreak"]
    },
    {
      "id": "neighborhood-park",
      "name": "Neighborhood Park",
      "imageUrl": "https://url-to-image.jpg",
      "description": "Damp park with string lights and old stage.",
      "atmosphere": "Unraveling trust and surrealism",
      "musicSuggestions": ["unraveling-trust", "emotional-surrealism"]
    }
  ],
  "music": [
    {
      "id": "track-id-warm-morning",
      "name": "Warm Morning",
      "url": "https://url-to-audio.mp3",
      "category": "emotional",
      "mood": "peaceful"
    },
    {
      "id": "track-id-rising-tension",
      "name": "Rising Tension",
      "url": "https://url-to-audio.mp3",
      "category": "emotional",
      "mood": "tense"
    },
    {
      "id": "track-id-panic-heartbreak",
      "name": "Panic Heartbreak",
      "url": "https://url-to-audio.mp3",
      "category": "emotional",
      "mood": "dramatic"
    },
    {
      "id": "track-id-unraveling-trust",
      "name": "Unraveling Trust",
      "url": "https://url-to-audio.mp3",
      "category": "emotional",
      "mood": "tense"
    },
    {
      "id": "track-id-emotional-surrealism",
      "name": "Emotional Surrealism",
      "url": "https://url-to-audio.mp3",
      "category": "emotional",
      "mood": "dramatic"
    },
    {
      "id": "track-id-relief-reflection",
      "name": "Relief Reflection",
      "url": "https://url-to-audio.mp3",
      "category": "emotional",
      "mood": "peaceful"
    }
  ],
  "storyTags": {
    "beneficial": ["Open-Hearted-1", "Gut-Feeling-1", "Pushing-For-Truth-1", "Trying-To-Trust-1", "Taking-Control-1"],
    "harmful": ["Unsettled-1", "Trust-Cracking-1", "Fractured-Trust-1", "Swallowed-Hurt-1", "Storm-Of-Feelings-1"],
    "investigation": ["Where-Is-Lune?-1", "Something’s-Not-Right-1", "Negligence-2", "Timeline-Inconsistent-2"],
    "emotional": ["Rising Anxiety-2", "Deflective Apology", "Frozen-1", "Overwhelmed-1", "Truth-Found-1"]
  },
  "statusTags": {
    "beneficial": ["Honest-Heart-1", "Healing-Starts-Here-2", "Boundary-Set-3", "Hopeful-Heart-1", "Not Alone-1"],
    "harmful": ["Self-Doubt-1", "Emotional-Distance-1", "Unresolved-Shame-2", "Carried-Loneliness-1"]
  },
  "checkpoints": [
    {
      "description": "Lune's disappearance and initial confrontation",
      "triggersChapter": 2,
      "optional": false
    },
    {
      "description": "Ignorance reveal in the park",
      "triggersChapter": 2,
      "optional": false
    },
    {
      "description": "Resolution of Inner Space and aftermath choice",
      "triggersChapter": 2,
      "optional": false
    }
  ]
}

